var donationIndex = 1;
var disInfos = new Map();
var trueInfos = new Map();
var disInfoPages = 1;
var trueInfoPages = 1;
var disInfoTotalPage = 19;
var trueInfoTotalPage = 2;
var bottomSlogan = [
    "把人民群众生命安全和身体健康放在第一位。",
    "抗击肺炎，众志成城",
    "抗击疫情 人人有责",
    "同舟共济 共渡难关",
    "积极行动起来 清除病害疫源",
    "勤快洗手：消毒杀菌，病毒赶走!",
    "重视自身健康 务必做好自我防护",
    "少出门 少聚集 勤洗手 勤通风",
    "有症状 早就医 不恐慌 不传谣",
    "讲求科学、文明、健康的生活方式",
    "拒绝扎堆：不图一时热闹，但求平安健康!",
    "有发热症状患者 请及时到医疗机构发热门诊就诊",
    "拒绝野味：不猎奇，不贪嘴，病从口入，教训牢记!",
    "拒绝谣言：只送祝福，不传谣言，别让错误信息帮倒忙!",
    "早发现、早报告、早隔离、早治疗 严防疫情扩散",
    "预防新型肺炎：勤洗手、勤洗脸、勤饮水、勤通风",
    "戴口罩 讲卫生 打喷嚏 捂口鼻 喷嚏后 慎揉眼",
    "让我们一起努力，早日打赢这场看不见硝烟的战争!",
    "初心四问就在前，使命担当我为先。",
    "全省动员、全民行动，集中力量坚决打赢疫情防控这场硬仗。"
];

var searchInfos = [];
var searchInfoPages = 1;

var trafficTypes = [
    "全部",
    "飞机",
    "火车",
    "地铁",
    "长途客车/大巴",
    "公交车",
    "出租车",
    "轮船",
    "其他公共场所"
];

var searchInfosforTrafficFlag = [0,0,0,0,0,0,0,0,0];
var searchInfosForTraffic = [[],[],[],[],[],[],[],[],[]];

var searchInfoForDetail = [];

var epidemicInfos = [];

var epidemicInfoContent = [
    "病毒：SARS-CoV-2，其导致疾病命名 COVID-19",
    "宿主：野生动物，可能为中华菊头蝠",
    "疑似病例数来自国家卫健委数据，目前为全国数据，未分省市自治区等。浙江省 12 例外省治愈暂无具体省份信息。",
    "易感人群：人群普遍易感。老年人及有基础疾病者感染后病情较重，儿童及婴幼儿也有发病",
    "潜伏期：一般为 3～7 天，最长不超过 14 天，潜伏期内可能存在传染性，其中无症状病例传染性非常罕见",
    "传播途径：经呼吸道飞沫、接触传播是主要的传播途径。气溶胶传播和消化道等传播途径尚待明确。"
];

var map;
var mapOption;
var sources;

var areaToIndex = new Map();
var epidemicGeneralInfos = [];

var worldInfos = [];

var  nameMap = {
    'Singapore Rep.':'新加坡',
    'Dominican Rep.':'多米尼加',
    'Palestine':'巴勒斯坦',
    'Bahamas':'巴哈马',
    'Timor-Leste':'东帝汶',
   'Afghanistan':'阿富汗',
   'Guinea-Bissau':'几内亚比绍',
   "Côte d'Ivoire":'科特迪瓦',
   'Siachen Glacier':'锡亚琴冰川',
   "Br. Indian Ocean Ter.":'英属印度洋领土',
   'Angola':'安哥拉',
   'Albania':'阿尔巴尼亚',
   'United Arab Emirates':'阿联酋',
   'Argentina':'阿根廷',
   'Armenia':'亚美尼亚',
   'French Southern and Antarctic Lands':'法属南半球和南极领地',
   'Australia':'澳大利亚',
   'Austria':'奥地利',
   'Azerbaijan':'阿塞拜疆',
   'Burundi':'布隆迪',
   'Belgium':'比利时',
   'Benin':'贝宁',
   'Burkina Faso':'布基纳法索',
   'Bangladesh':'孟加拉国',
   'Bulgaria':'保加利亚',
   'The Bahamas':'巴哈马',
   'Bosnia and Herz.':'波斯尼亚和黑塞哥维那',
   'Belarus':'白俄罗斯',
   'Belize':'伯利兹',
   'Bermuda':'百慕大',
   'Bolivia':'玻利维亚',
   'Brazil':'巴西',
   'Brunei':'文莱',
   'Bhutan':'不丹',
   'Botswana':'博茨瓦纳',
   'Central African Rep.':'中非',
   'Canada':'加拿大',
   'Switzerland':'瑞士',
   'Chile':'智利',
   'China':'中国',
   'Ivory Coast':'象牙海岸',
   'Cameroon':'喀麦隆',
   'Dem. Rep. Congo':'刚果民主共和国',
   'Congo':'刚果',
   'Colombia':'哥伦比亚',
   'Costa Rica':'哥斯达黎加',
   'Cuba':'古巴',
   'N. Cyprus':'北塞浦路斯',
   'Cyprus':'塞浦路斯',
   'Czech Rep.':'捷克',
   'Germany':'德国',
   'Djibouti':'吉布提',
   'Denmark':'丹麦',
   'Algeria':'阿尔及利亚',
   'Ecuador':'厄瓜多尔',
   'Egypt':'埃及',
   'Eritrea':'厄立特里亚',
   'Spain':'西班牙',
   'Estonia':'爱沙尼亚',
   'Ethiopia':'埃塞俄比亚',
   'Finland':'芬兰',
   'Fiji':'斐',
   'Falkland Islands':'福克兰群岛',
   'France':'法国',
   'Gabon':'加蓬',
   'United Kingdom':'英国',
   'Georgia':'格鲁吉亚',
   'Ghana':'加纳',
   'Guinea':'几内亚',
   'Gambia':'冈比亚',
   'Guinea Bissau':'几内亚比绍',
   'Eq. Guinea':'赤道几内亚',
   'Greece':'希腊',
   'Greenland':'格陵兰',
   'Guatemala':'危地马拉',
   'French Guiana':'法属圭亚那',
   'Guyana':'圭亚那',
   'Honduras':'洪都拉斯',
   'Croatia':'克罗地亚',
   'Haiti':'海地',
   'Hungary':'匈牙利',
   'Indonesia':'印度尼西亚',
   'India':'印度',
   'Ireland':'爱尔兰',
   'Iran':'伊朗',
   'Iraq':'伊拉克',
   'Iceland':'冰岛',
   'Israel':'以色列',
   'Italy':'意大利',
   'Jamaica':'牙买加',
   'Jordan':'约旦',
   'Japan':'日本',
   'Kazakhstan':'哈萨克斯坦',
   'Kenya':'肯尼亚',
   'Kyrgyzstan':'吉尔吉斯斯坦',
   'Cambodia':'柬埔寨',
   'Korea':'韩国',
   'Kosovo':'科索沃',
   'Kuwait':'科威特',
   'Lao PDR':'老挝',
   'Lebanon':'黎巴嫩',
   'Liberia':'利比里亚',
   'Libya':'利比亚',
   'Sri Lanka':'斯里兰卡',
   'Lesotho':'莱索托',
   'Lithuania':'立陶宛',
   'Luxembourg':'卢森堡',
   'Latvia':'拉脱维亚',
   'Morocco':'摩洛哥',
   'Moldova':'摩尔多瓦',
   'Madagascar':'马达加斯加',
   'Mexico':'墨西哥',
   'Macedonia':'马其顿',
   'Mali':'马里',
   'Myanmar':'缅甸',
   'Montenegro':'黑山',
   'Mongolia':'蒙古',
   'Mozambique':'莫桑比克',
   'Mauritania':'毛里塔尼亚',
   'Malawi':'马拉维',
   'Malaysia':'马来西亚',
   'Namibia':'纳米比亚',
   'New Caledonia':'新喀里多尼亚',
   'Niger':'尼日尔',
   'Nigeria':'尼日利亚',
   'Nicaragua':'尼加拉瓜',
   'Netherlands':'荷兰',
   'Norway':'挪威',
   'Nepal':'尼泊尔',
   'New Zealand':'新西兰',
   'Oman':'阿曼',
   'Pakistan':'巴基斯坦',
   'Panama':'巴拿马',
   'Peru':'秘鲁',
   'Philippines':'菲律宾',
   'Papua New Guinea':'巴布亚新几内亚',
   'Poland':'波兰',
   'Puerto Rico':'波多黎各',
   'Dem. Rep. Korea':'朝鲜',
   'Portugal':'葡萄牙',
   'Paraguay':'巴拉圭',
   'Qatar':'卡塔尔',
   'Romania':'罗马尼亚',
   'Russia':'俄罗斯',
   'Rwanda':'卢旺达',
   'W. Sahara':'西撒哈拉',
   'Saudi Arabia':'沙特阿拉伯',
   'Sudan':'苏丹',
   'S. Sudan':'南苏丹',
   'Senegal':'塞内加尔',
   'Solomon Is.':'所罗门群岛',
   'Sierra Leone':'塞拉利昂',
   'El Salvador':'萨尔瓦多',
   'Somaliland':'索马里兰',
   'Somalia':'索马里',
   'Serbia':'塞尔维亚',
   'Suriname':'苏里南',
   'Slovakia':'斯洛伐克',
   'Slovenia':'斯洛文尼亚',
   'Sweden':'瑞典',
   'Swaziland':'斯威士兰',
   'Syria':'叙利亚',
   'Chad':'乍得',
   'Togo':'多哥',
   'Thailand':'泰国',
   'Tajikistan':'塔吉克斯坦',
   'Turkmenistan':'土库曼斯坦',
   'East Timor':'东帝汶',
   'Trinidad and Tobago':'特里尼达和多巴哥',
   'Tunisia':'突尼斯',
   'Turkey':'土耳其',
   'Tanzania':'坦桑尼亚',
   'Uganda':'乌干达',
   'Ukraine':'乌克兰',
   'Uruguay':'乌拉圭',
   'United States':'美国',
   'Uzbekistan':'乌兹别克斯坦',
   'Venezuela':'委内瑞拉',
   'Vietnam':'越南',
   'Vanuatu':'瓦努阿图',
   'West Bank':'西岸',
   'Yemen':'也门',
   'South Africa':'南非',
   'Zambia':'赞比亚',
   'Zimbabwe':'津巴布韦'
};

var worldMap;
var worldMapOption;

var moveOutInfoMap = new Map();
var moveOutDate;

var moveInInfoMap = new Map();
var moveInDate;

var moveOutMap;
var moveOutMapOption;

var chinaLatAndLong = [ 
 {name:'北京',value:['116.3979471','39.9081726']},
 { name: '上海', value: [ '121.4692688', '31.2381763' ] },
 { name: '天津', value: [ '117.2523808', '39.1038561' ] },
 { name: '重庆', value: [ '106.548425', '29.5549144'] },
 { name: '河北', value: [ '114.4897766', '38.0451279' ] },
 { name: '山西', value: [ '112.5223053', '37.8357424'] },
 { name: '辽宁', value: [ '123.4116821', '41.7966156'] },
 { name: '吉林', value: [ '125.3154297', '43.8925629'] },
 { name: '黑龙江', value: [ '126.6433411', '45.7414932'] },
 { name: '浙江', value: [ '120.1592484', '30.265995'] },
    { name: '福建', value: [ '119.2978134', '26.0785904'] },
    { name: '山东', value: [ '117.0056', '36.6670723' ] },
    { name: '河南', value: [ '113.6500473', '34.7570343'] },
    { name: '湖北', value: [ '114.2919388', '30.5675144'] },
    { name: '湖南', value: [ '112.9812698', '28.2008247'] },
    { name: '广东', value: [ '113.2614288', '23.1189117' ] },
    { name: '海南', value: [ '110.3465118', '20.0317936'] },
    { name: '四川', value: [ '104.0817566', '30.6610565' ] },
    { name: '贵州', value: [ '106.7113724', '26.5768738'] },
    { name: '云南', value: [ '102.704567', '25.0438442'] },
    { name: '江西', value: [ '115.8999176', '28.6759911'] },
    { name: '陕西', value: [ '108.949028', '34.2616844'] },
    { name: '青海', value: [ '101.7874527', '36.6094475' ] },
    { name: '甘肃', value: [ '103.7500534', '36.0680389' ] },
    { name: '广西', value: [ '108.3117676', '22.8065434'] },
    { name: '新疆', value: [ '87.6061172', '43.7909393' ] },
    { name: '内蒙古', value: [ '111.6632996', '40.8209419'] },
    { name: '西藏', value: [ '91.1320496', '29.657589'] },
    { name: '宁夏', value: [ '106.2719421', '38.4680099'] },
    { name: '台湾', value: [ '120.9581316', '23.8516062'] },
    { name: '香港', value: [ '114.139452', '22.391577' ] },
    { name: '澳门', value: [ '113.5678411', '22.167654' ] },
    { name: '安徽', value: [ '117.2757034', '31.8632545'] },
    { name: '江苏', value: [ '118.7727814', '32.0476151' ] } 
];

var planePath = "path://M995.679767 658.818049c-8.943231-1.490539-23.848617-2.981077-44.716157-4.471615-73.03639-8.943231-207.184862-26.829694-295.126638-38.754003l-19.377001-5.962154h-2.981077l-44.716157-13.414848c-4.471616 90.922853-10.43377 166.94032-17.886463 225.071325v10.43377l22.358078 10.43377 70.055313 32.791849c2.981077 1.490539 4.471616 4.471616 4.471616 7.452693l1.490539 55.149927v4.471615c0 2.981077-1.490539 5.962154-4.471616 4.471616l-114.77147-19.377001c-8.943231 22.358079-17.886463 34.282387-31.30131 35.772925h-1.490539c-13.414847 0-23.848617-11.924309-31.30131-35.772925l-114.77147 17.886463c-2.981077 0-4.471616-1.490539-4.471616-4.471616v-4.471616l1.490539-55.149927c0-2.981077 1.490539-5.962154 4.471615-7.452693l70.055313-32.791849 22.358079-10.43377V819.796215c-5.962154-58.131004-10.43377-134.148472-14.905386-225.071324l-46.206696 13.414847h-4.471615l-19.377002 4.471616c-87.941776 10.43377-222.090247 26.829694-295.126637 35.772925-20.86754 2.981077-35.772926 4.471616-44.716158 4.471616-23.848617 2.981077-25.339156-26.829694-7.452692-37.263464 2.981077-1.490539 56.640466-29.810771 123.714701-67.074236v-38.754003c0-14.905386 11.924309-26.829694 26.829695-26.829694s26.829694 11.924309 26.829694 26.829694v8.943232c40.244541-20.86754 81.979622-43.225619 119.243086-64.093159v-44.716157c0-14.905386 11.924309-26.829694 26.829694-26.829695s26.829694 11.924309 26.829694 26.829695v14.905385c23.848617-11.924309 43.225619-23.848617 56.640466-31.30131-1.490539-174.393013 11.924309-308.541485 61.112082-332.390101 2.981077-1.490539 4.471616-1.490539 7.452693-2.981078 1.490539 0 4.471616 0 5.962154-1.490538h5.962154c1.490539 0 4.471616 0 5.962154 1.490538 2.981077 0 4.471616 1.490539 7.452693 2.981078 49.187773 23.848617 62.60262 157.997089 58.131005 332.390101 13.414847 7.452693 32.791849 17.886463 55.149927 29.810772v-14.905386c0-14.905386 11.924309-26.829694 26.829694-26.829694s26.829694 11.924309 26.829695 26.829694v44.716157c37.263464 20.86754 78.998544 43.225619 119.243085 65.583698V506.783115c0-14.905386 11.924309-26.829694 26.829695-26.829694s26.829694 11.924309 26.829694 26.829694v44.716157c68.564774 37.263464 122.224163 67.074236 123.714702 68.564775 25.339156 10.43377 23.848617 41.73508-1.490539 38.754002z";


var newsMap = new Map();

var names = ['湖北省','北京市','上海市','天津市','重庆市','河北省','山西省','辽宁省','吉林省',
            '黑龙江省','浙江省','福建省','山东省','河南省','湖南省','广东省',
            '海南省','四川省','贵州省','云南省','江西省','陕西省','青海省','甘肃省','广西壮族自治区',
            '新疆维吾尔自治区','内蒙古自治区','宁夏回族自治区','西藏自治区','台湾','香港','澳门','安徽省','江苏省'];


